Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.h
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
 */

#ifndef	_MCXNEX_H
#define	_MCXNEX_H

/*
 * mcxnex.h
 *    Contains the #defines and typedefs necessary for the softstate
 *    structure and for proper attach() and detach() processing.  Also
 *    includes all the other Mcxnex header files (and so is the only header
 *    file that is directly included by the source files).
 *    Lastly, this file includes everything necessary for implementing the
 *    devmap interface and for maintaining the "mapped resource database".
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/taskq.h>
#include <sys/atomic.h>
#ifdef FMA_TEST
#include <sys/modhash.h>
#endif

#include <sys/ib/ibtl/ibci.h>
#include <sys/ib/ibtl/impl/ibtl_util.h>
#include <sys/ib/adapters/mlnx_umap.h>

/*
 * First include all the typedefs, then include all the other device
 * specific headers (many of which depend on the typedefs having
 * already been defined).
 */
#include "mcxnex_typedef.h"
#include "mcxnex_hw.h"

#include "mcxnex_cfg.h"
#include "mcxnex_cmd.h"
#include "mcxnex_cq.h"
#include "mcxnex_event.h"
#include "mcxnex_ioctl.h"
#include "mcxnex_misc.h"
#include "mcxnex_mr.h"
#include "mcxnex_wr.h"
#include "mcxnex_qp.h"
#include "mcxnex_srq.h"
#include "mcxnex_rsrc.h"
#include "mcxnex_fm.h"

/*
 * Number of initial states to setup. Used in call to ddi_soft_state_init()
 */
#define	MCXNEX_INITIAL_STATES		3

/*
 * Macro and defines used to calculate device instance number from minor
 * number (and vice versa).
 */
#define	MCXNEX_MINORNUM_SHIFT		3
#define	MCXNEX_DEV_INSTANCE(dev)	(getminor((dev)) &	\
	((1 << MCXNEX_MINORNUM_SHIFT) - 1))

/*
 * Locations for the various Mcxnex hardware CMD,UAR & MSIx PCIe BARs
 */
#define	MCXNEX_CMD_BAR			1 /* device config space */
#define	MCXNEX_UAR_BAR			2 /* UAR Region */
#define	MCXNEX_MSIX_BAR			3 /* MSI-X Table */

#define	MCXNEX_ONCLOSE_FLASH_INPROGRESS		(1 << 0)

#define	MCXNEX_MSIX_MAX			8 /* max # of interrupt vectors */

/*
 * VPD header size - or more rightfully, the area of interest for fwflash
 * 	There's more, but we don't need it for our use so we don't read it
 */
#define	MCXNEX_VPD_HDR_DWSIZE		0x10 /* 16 Dwords */
#define	MCXNEX_VPD_HDR_BSIZE		0x40 /* 64 Bytes */

/*
 * Offsets to be used w/ reset to save/restore PCI capability stuff
 */
#define	MCXNEX_PCI_CAP_DEV_OFFS		0x08
#define	MCXNEX_PCI_CAP_LNK_OFFS		0x10


/*
 * Some defines for the software reset.  These define the value that should
 * be written to begin the reset (MCXNEX_SW_RESET_START), the delay before
 * beginning to poll for completion (MCXNEX_SW_RESET_DELAY), the in-between
 * polling delay (MCXNEX_SW_RESET_POLL_DELAY), and the value that indicates
 * that the reset has not completed (MCXNEX_SW_RESET_NOTDONE).
 */
#define	MCXNEX_SW_RESET_START		0x00000001
#define	MCXNEX_SW_RESET_DELAY		1000000	 /* 1000 ms, per 0.36 PRM */
#define	MCXNEX_SW_RESET_POLL_DELAY	100	 /* 100 us */
#define	MCXNEX_SW_RESET_NOTDONE		0xFFFFFFFF

/*
 * These defines are used in the Mcxnex software reset operation.  They define
 * the total number PCI registers to read/restore during the reset.  And they
 * also specify two config registers which should not be read or restored.
 */
#define	MCXNEX_SW_RESET_NUMREGS		0x40
#define	MCXNEX_SW_RESET_REG22_RSVD	0x16	/* 22 dec */
#define	MCXNEX_SW_RESET_REG23_RSVD	0x17	/* 23 dec */

/*
 * Macro used to output HCA warning messages.  Note: HCA warning messages
 * are only generated when an unexpected condition has been detected.  This
 * can be the result of a software bug or some other problem, but it is more
 * often an indication that the HCA firmware (and/or hardware) has done
 * something unexpected.  This warning message means that the driver state
 * in unpredictable and that shutdown/restart is suggested.
 */
#define	MCXNEX_WARNING(state, ...)	\
	mcxnex_printf(state, CE_WARN, __VA_ARGS__)
#define	MCXNEX_NOTE(state, ...)		\
	mcxnex_printf(state, CE_NOTE, __VA_ARGS__)



/*
 * Macro used to set attach failure messages.  Also, the attach message buf
 * size is set here.
 */
#define	MCXNEX_ATTACH_MSGSIZE	80
#define	MCXNEX_ATTACH_MSG(attach_buf, attach_msg)		\
	(void) snprintf((attach_buf), MCXNEX_ATTACH_MSGSIZE, (attach_msg));
#define	MCXNEX_ATTACH_MSG_INIT(attach_buf)			\
	(attach_buf)[0] = '\0';

/*
 * Macros used for controlling whether or not event callbacks will be forwarded
 * to the IBTF.  This is necessary because there are certain race conditions
 * that can occur (e.g. calling IBTF with an asynch event before the IBTF
 * registration has successfully completed or handling an event after we've
 * detached from the IBTF.)
 *
 * MCXNEX_ENABLE_IBTF_CALLB() initializes the "hs_ibtfpriv" field in the Mcxnex
 *    softstate.  When "hs_ibtfpriv" is non-NULL, it is OK to forward asynch
 *    and CQ events to the IBTF.
 *
 * MCXNEX_DO_IBTF_ASYNC_CALLB() and MCXNEX_DO_IBTF_CQ_CALLB() both set and clear
 *    the "hs_in_evcallb" flag, as necessary, to indicate that an IBTF
 *    callback is currently in progress.  This is necessary so that we can
 *    block on this condition in mcxnex_detach().
 *
 * MCXNEX_QUIESCE_IBTF_CALLB() is used in mcxnex_detach() to set the
 *    "hs_ibtfpriv" to NULL (thereby disabling any further IBTF callbacks)
 *    and to poll on the "hs_in_evcallb" flag.  When this flag is zero, all
 *    IBTF callbacks have quiesced and it is safe to continue with detach
 *    (i.e. continue detaching from IBTF).
 */
#define	MCXNEX_ENABLE_IBTF_CALLB(state, tmp_ibtfpriv)		\
	(state)->hs_ibtfpriv = (tmp_ibtfpriv);

#define	MCXNEX_DO_IBTF_ASYNC_CALLB(state, type, event)			\
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS((state)->hs_in_evcallb))	\
	(state)->hs_in_evcallb = 1;					\
	mcxnex_priv_async_handler(state, (type), (event));		\
	(state)->hs_in_evcallb = 0;

#define	MCXNEX_DO_IBTF_CQ_CALLB(state, cq)			\
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS((state)->hs_in_evcallb))	\
	(state)->hs_in_evcallb = 1;					\
	mcxnex_priv_cq_handler(state, cq);			\
	(state)->hs_in_evcallb = 0;

