Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.h
#define	MCXNEX_QUIESCE_IBTF_CALLB(state)			\
{									\
	uint_t		count = 0;					\
									\
	state->hs_ibtfpriv = NULL;					\
	while (((state)->hs_in_evcallb != 0) &&				\
	    (count++ < MCXNEX_QUIESCE_IBTF_CALLB_POLL_MAX)) {		\
		drv_usecwait(MCXNEX_QUIESCE_IBTF_CALLB_POLL_DELAY);	\
	}								\
}


/*
 * Defines used by the MCXNEX_QUIESCE_IBTF_CALLB() macro to determine the
 * duration and number of times (at maximum) to poll while waiting for IBTF
 * callbacks to quiesce.
 */
#define	MCXNEX_QUIESCE_IBTF_CALLB_POLL_DELAY	1
#define	MCXNEX_QUIESCE_IBTF_CALLB_POLL_MAX	1000000

/*
 * Macros to retrieve PCI id's of the device
 */
#define	MCXNEX_DDI_PROP_GET(dip, property) \
	(ddi_prop_get_int(DDI_DEV_T_ANY, dip, DDI_PROP_DONTPASS, \
	    property, -1))

#define	MCXNEX_GET_VENDOR_ID(dip)	MCXNEX_DDI_PROP_GET(dip, "vendor-id")
#define	MCXNEX_GET_DEVICE_ID(dip)	MCXNEX_DDI_PROP_GET(dip, "device-id")
#define	MCXNEX_GET_REVISION_ID(dip)	MCXNEX_DDI_PROP_GET(dip, "revision-id")



/*
 * Define used to determine the device mode to which Mcxnex driver has been
 * attached.  MCXNEX_IS_MAINTENANCE_MODE() returns true when the device has
 * come up in the "maintenance mode".  In this mode, no InfiniBand interfaces
 * are enabled, but the device's firmware can be updated/flashed (and
 * test/debug interfaces should be useable).
 * MCXNEX_IS_HCA_MODE() returns true when the device has come up in the
 * normal HCA mode.  In this mode, all necessary InfiniBand interfaces are
 * enabled (and, if necessary, MCXNEX firmware can be updated/flashed).
 */
#define	MCXNEX_IS_MAINTENANCE_MODE(dip)			\
	((ddi_prop_get_int(DDI_DEV_T_ANY, (dip), DDI_PROP_DONTPASS,	\
	"device-id", -1) == PCI_DEVID_MCXNEX_MAINT) &&			\
	(ddi_prop_get_int(DDI_DEV_T_ANY, (dip), DDI_PROP_DONTPASS,	\
	"vendor-id", -1) == PCI_VENID_MLX))

#define	MCXNEX_IS_HCA_MODE(dip)			\
	(((ddi_prop_get_int(DDI_DEV_T_ANY, (dip), DDI_PROP_DONTPASS,	\
	"device-id", -1) == PCI_DEVID_MCXNEX_SDR) ||			\
	(ddi_prop_get_int(DDI_DEV_T_ANY, (dip), DDI_PROP_DONTPASS,	\
	"device-id", -1) == PCI_DEVID_MCXNEX_DDR) ||			\
	(ddi_prop_get_int(DDI_DEV_T_ANY, (dip), DDI_PROP_DONTPASS,	\
	"device-id", -1) == PCI_DEVID_MCXNEX_DDRG2) ||			\
	(ddi_prop_get_int(DDI_DEV_T_ANY, (dip), DDI_PROP_DONTPASS,	\
	"device-id", -1) == PCI_DEVID_MCXNEX_QDRG2) ||			\
	(ddi_prop_get_int(DDI_DEV_T_ANY, (dip), DDI_PROP_DONTPASS,	\
	"device-id", -1) == PCI_DEVID_MCXNEX_CX2) ||			\
	(ddi_prop_get_int(DDI_DEV_T_ANY, (dip), DDI_PROP_DONTPASS,	\
	"device-id", -1) == PCI_DEVID_MCXNEX_ENVIRT) ||			\
	(ddi_prop_get_int(DDI_DEV_T_ANY, (dip), DDI_PROP_DONTPASS,	\
	"device-id", -1) == PCI_DEVID_MCXNEX_EN10G)) &&			\
	(ddi_prop_get_int(DDI_DEV_T_ANY, (dip), DDI_PROP_DONTPASS,	\
	"vendor-id", -1) == PCI_VENID_MLX))

#define	MCXNEX_MAINTENANCE_MODE		1
#define	MCXNEX_HCA_MODE			2

#define	MCXNEX_FW_VER_VLAN_STRIP_CAP	2079000
#define	MCXNEX_FW_VER_NUM(state)				\
	((uint64_t)((state)->hs_fw.fw_rev_major * 1000000) +	\
	(state)->hs_fw.fw_rev_minor * 10000 +			\
	(state)->hs_fw.fw_rev_subminor)

/*
 * Used to determine if the device is operational, or not in maintenance mode.
 * This means either the driver has attached successfully against an mcxnex
 * device in mcxnex compatibility mode, or against a mcxnex device in full HCA
 * mode.
 */
#define	MCXNEX_IS_OPERATIONAL(mode)				\
	(mode == MCXNEX_HCA_MODE)

/*
 * The following define is used (in mcxnex_umap_db_set_onclose_cb()) to
 * indicate that a cleanup callback is needed to undo initialization done
 * by the firmware flash burn code.
 */
#define	MCXNEX_ONCLOSE_FLASH_INPROGRESS		(1 << 0)

/*
 * The following enumerated type and structures are used during driver
 * initialization.  Note: The MCXNEX_DRV_CLEANUP_ALL type is used as a marker
 * for end of the cleanup steps.  No cleanup steps should be added after
 * MCXNEX_DRV_CLEANUP_ALL.  Any addition steps should be added before it.
 */
typedef enum {
	MCXNEX_DRV_CLEANUP_LEVEL0,
	MCXNEX_DRV_CLEANUP_LEVEL1,
	MCXNEX_DRV_CLEANUP_LEVEL2,
	MCXNEX_DRV_CLEANUP_LEVEL3,
	MCXNEX_DRV_CLEANUP_LEVEL4,
	MCXNEX_DRV_CLEANUP_LEVEL5,
	MCXNEX_DRV_CLEANUP_LEVEL6,
	MCXNEX_DRV_CLEANUP_LEVEL7,
	MCXNEX_DRV_CLEANUP_LEVEL8,
	MCXNEX_DRV_CLEANUP_LEVEL9,
	MCXNEX_DRV_CLEANUP_LEVEL10,
	MCXNEX_DRV_CLEANUP_LEVEL11,
	MCXNEX_DRV_CLEANUP_LEVEL12,
	MCXNEX_DRV_CLEANUP_LEVEL13,
	MCXNEX_DRV_CLEANUP_LEVEL14,
	MCXNEX_DRV_CLEANUP_LEVEL15,
	MCXNEX_DRV_CLEANUP_LEVEL16,
	MCXNEX_DRV_CLEANUP_LEVEL17,
	MCXNEX_DRV_CLEANUP_LEVEL18,
	MCXNEX_DRV_CLEANUP_LEVEL19,
	/* No more driver cleanup steps below this point! */
	MCXNEX_DRV_CLEANUP_ALL
} mcxnex_drv_cleanup_level_t;

/*
 * The mcxnex_dma_info_t structure is used to store information related to
 * the various ICM resources' DMA allocations.  The related ICM table and
 * virtual address are stored here.  The DMA and Access handles are stored
 * here.  Also, the allocation length and virtual (host) address.
 */
struct mcxnex_dma_info_s {
	ddi_dma_handle_t	dma_hdl;
	ddi_acc_handle_t	acc_hdl;
	uint64_t		icmaddr;	/* ICM virtual address */
	uint64_t		vaddr;  	/* host virtual address */
	uint_t			length;		/* length requested */
	uint_t			icm_refcnt;	/* refcnt */
};
_NOTE(SCHEME_PROTECTS_DATA("safe sharing",
    mcxnex_dma_info_s::icm_refcnt))


/*
 * The mcxnex_cmd_reg_t structure is used to hold the address of the each of
 * the most frequently accessed hardware registers.  Specifically, it holds
 * the HCA Command Registers (HCR, used to pass command and mailbox
 * information back and forth to Mcxnex firmware) and the lock used to guarantee
 * mutually exclusive access to the registers.
 * Related to this, is the "clr_int" register which is used to clear the
 * interrupt once all EQs have been serviced.
 * Finally, there is the software reset register which is used to reinitialize
 * the Mcxnex device and to put it into a known state at driver startup time.
 * Below we also have the offsets (into the CMD register space) for each of
 * the various registers.
 */
typedef struct mcxnex_cmd_reg_s {
	mcxnex_hw_hcr_t	*hcr;
	kmutex_t	hcr_lock;
	uint64_t	*clr_intr;
	uint64_t	*eq_arm;
	uint64_t	*eq_set_ci;
	uint32_t	*sw_reset;
	uint32_t	*sw_semaphore;
	uint32_t	*fw_err_buf;
} mcxnex_cmd_reg_t;
_NOTE(MUTEX_PROTECTS_DATA(mcxnex_cmd_reg_t::hcr_lock,
    mcxnex_cmd_reg_t::hcr))

/* SOME TEMPORARY PRINTING THINGS */
#define	MCXNEX_PRINT_CI		(0x01 << 0)
#define	MCXNEX_PRINT_MEM	(0x01 << 1)
#define	MCXNEX_PRINT_CQ		(0x01 << 2)


