Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.h
#define	HD_PRINT(state, mask)	\
	if (state->hs_debug_lev & mask)

/* END PRINTING THINGS */

/*
 * Parent data.  Used by nexus and children for ddi_parent_data.
 */
typedef struct mcxnex_ppd {
	mcxnex_state_t	*cp_state;
	int		cp_port;
} mcxnex_ppd_t;

/*
 * The mcxnex_state_t structure is the HCA software state structure.  It
 * contains all the pointers and placeholder for everything that the HCA
 * driver needs to properly operate.  One of these structures exists for
 * every instance of the HCA driver.
 */

struct mcxnex_state_s {
	dev_info_t		*hs_dip;
	int			hs_instance;
int			hs_debug;	/* for debug, a way of tracing */
uint32_t		hs_debug_lev;	/* for controlling prints, a bit mask */
					/* see mcxnex.c for setting it */
	/* PCI device, vendor, and revision IDs */
	uint16_t		hs_vendor_id;
	uint16_t		hs_device_id;
	uint8_t			hs_revision_id;

struct mcxnex_hw_qpc_s		hs_debug_qpc;
struct mcxnex_hw_cqc_s		hs_debug_cqc;
struct mcxnex_hw_eqc_s		hs_debug_eqc;

	mcxnex_hw_sm_perfcntr_t	hs_debug_perf;


	/*
	 * DMA information for the InfiniHost Context Memory (ICM),
	 * ICM Auxiliary allocation and the firmware. Also, record
	 * of ICM and ICMA sizes, in bytes.
	 */
	/* JBDB -- store here hs_icm_table, with hs_icm_dma in */

	uint64_t		hs_icm_sz;
	mcxnex_icm_table_t	*hs_icm;
	uint64_t		hs_icma_sz;
	mcxnex_dma_info_t	hs_icma_dma;
	mcxnex_dma_info_t	hs_fw_dma;

	/* Mcxnex interrupt/MSI information */
	int			hs_intr_types_avail;
	uint_t			hs_intr_type_chosen;
	int			hs_intrmsi_count;
	int			hs_intrmsi_avail;
	int			hs_intrmsi_allocd;
	ddi_intr_handle_t	hs_intrmsi_hdl[MCXNEX_MSIX_MAX];
	uint_t			hs_intrmsi_pri;
	int			hs_intrmsi_cap;

	/* assign EQs to CQs in a round robin fashion */
	uint_t			hs_eq_dist;	/* increment when used */

	/* mcxnex HCA name and HCA part number */
	char			hs_hca_name[64];
	char			hs_hca_pn[64];
	int			hs_hca_pn_len;

	/* Mcxnex device operational mode */
	int			hs_operational_mode;

	/* Attach buffer saved per state to store detailed attach errors */
	char			hs_attach_buf[MCXNEX_ATTACH_MSGSIZE];

	/* Mcxnex NodeGUID, SystemImageGUID, and NodeDescription */
	uint64_t		hs_nodeguid;
	uint64_t		hs_sysimgguid;
	char			hs_nodedesc[64];

	/* Info passed to IBTF during registration */
	ibc_hca_info_t		hs_ibtfinfo;
	/* ibc_clnt_hdl_t		hs_ibtfpriv; */
	void			*hs_ibtfpriv;

	/*
	 * Mcxnex register mapping.  Holds the device access attributes,
	 * kernel mapped addresses, and DDI access handles for both
	 * Mcxnex's CMD and UAR BARs.
	 */
	ddi_device_acc_attr_t	hs_reg_accattr;
	caddr_t			hs_reg_cmd_baseaddr;	/* Mcxnex CMD BAR */
	ddi_acc_handle_t	hs_reg_cmdhdl;
	caddr_t			hs_reg_uar_baseaddr;	/* Mcxnex UAR BAR */
	ddi_acc_handle_t	hs_reg_uarhdl;
	caddr_t			hs_reg_msi_baseaddr;	/* Mcxnex MSIx BAR */
	ddi_acc_handle_t	hs_reg_msihdl;

	/*
	 * Some additional things for UAR Pages
	 */
	uint64_t		hs_kernel_uar_index;	/* kernel UAR index */
	uint64_t		hs_bf_offset;		/* offset from UAR */
							/* Bar to Blueflame */
	caddr_t			hs_reg_bf_baseaddr;	/* blueflame base */
	ddi_acc_handle_t	hs_reg_bfhdl;  		/* blueflame handle */


	/*
	 * Mcxnex PCI config space registers.  This array is used to
	 * save and restore the PCI config registers before and after a
	 * software reset.
	 */
	uint32_t		hs_cfg_data[MCXNEX_SW_RESET_NUMREGS];
	/* for reset per Linux driver */
	uint32_t		hs_pci_cap_offset;
	uint32_t		hs_pci_cap_devctl;
	uint32_t		hs_pci_cap_lnkctl;

	/*
	 * Mcxnex UAR page resources.  Holds the resource pointers for
	 * UAR page #0 (reserved) and for UAR page #1 (used for kernel
	 * driver doorbells).  In addition, we save a pointer to the
	 * UAR page #1 doorbells which will be used throughout the driver
	 * whenever it is necessary to ring one of them.  And, in case we
	 * are unable to do 64-bit writes to the page (because of system
	 * architecture), we include a lock (to ensure atomic 64-bit access).
	 */
	mcxnex_rsrc_t		*hs_uarpg0_rsrc_rsrvd;
	mcxnex_rsrc_t		*hs_uarkpg_rsrc;
	mcxnex_hw_uar_t		*hs_uar;
	kmutex_t		hs_uar_lock;

	/*
	 * Used during a call to open() if we are in maintenance mode, this
	 * field serves as a semi-unique rolling count index value, used only
	 * in the setup of umap_db entries.  This is primarily needed to
	 * firmware device access ioctl operations can still be guaranteed to
	 * close in the event of an unplanned process exit, even in maintenance
	 * mode.
	 */
	uint_t			hs_open_ar_indx;

	/*
	 * Mcxnex Port types
	 *
	 */
	uint_t			hs_port_type[MCXNEX_MAX_PORTS];
	mcxnex_ppd_t		hs_ppd[MCXNEX_MAX_PORTS];

	/*
	 * Mcxnex command registers.  This structure contains the addresses
	 * for each of the most frequently accessed CMD registers.  Since
	 * almost all accesses to the Mcxnex hardware are through the Mcxnex
	 * command interface (i.e. the HCR), we save away the pointer to
	 * the HCR, as well as pointers to the ECR and INT registers (as
	 * well as their corresponding "clear" registers) for interrupt
	 * processing.  And we also save away a pointer to the software
	 * reset register (see above).
	 */
	mcxnex_cmd_reg_t	hs_cmd_regs;
	uint32_t		hs_cmd_toggle;

	/*
	 * Mcxnex resource pointers.  The following are pointers to the
	 * kmem cache (from which the Mcxnex resource handles are allocated),
	 * and the array of "resource pools" (which store all the pertinent
	 * information necessary to manage each of the various types of
	 * resources that are used by the driver.  See mcxnex_rsrc.h for
	 * more detail.
	 */
	kmem_cache_t		*hs_rsrc_cache;
	mcxnex_rsrc_pool_info_t	*hs_rsrc_hdl;

	/*
	 * Mailbox lists.  These hold the information necessary to
	 * manage the pools of pre-allocated mailboxes (both "In" and
	 * "Out" type).  See mcxnex_cmd.h for more detail.
	 */
	mcxnex_mboxlist_t		hs_in_mblist;
	mcxnex_mboxlist_t		hs_out_mblist;

	/*
	 * Interrupt mailbox lists.  We allocate both an "In" mailbox
	 * and an "Out" type mailbox for the interrupt context.  This is in
	 * order to guarantee that a mailbox entry will always be available in
	 * the interrupt context, and we can NOSLEEP without having to worry
	 * about possible failure allocating the mbox.  We create this as an
	 * mboxlist so that we have the potential for having multiple mboxes
	 * available based on the number of interrupts we can receive at once.
	 */
	mcxnex_mboxlist_t		hs_in_intr_mblist;
	mcxnex_mboxlist_t		hs_out_intr_mblist;

