Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.h
	/* members to handle MSI-X tables */
	ddi_acc_handle_t	hs_reg_msix_tblhdl;	/* MSI-X table handle */
	ddi_acc_handle_t	hs_fm_msix_tblhdl;	/* 	fm handle */
	char 			*hs_msix_tbl_addr;	/* MSI-X table addr */
	char 			*hs_msix_tbl_entries;	/* MSI-X table entry */
	size_t			hs_msix_tbl_size;	/* MSI-X table size */
	uint32_t		hs_msix_tbl_offset;	/* MSI-X table offset */
	uint32_t		hs_msix_tbl_rnumber;	/* MSI-X table reg# */

	/* members to handle MSI-X PBA */
	ddi_acc_handle_t	hs_reg_msix_pbahdl;	/* MSI-X PBA handle */
	ddi_acc_handle_t	hs_fm_msix_pbahdl;	/* 	fm handle */
	char 			*hs_msix_pba_addr;	/* MSI-X PBA addr */
	char 			*hs_msix_pba_entries;	/* MSI-X PBA entry */
	size_t			hs_msix_pba_size;	/* MSI-X PBA size */
	uint32_t		hs_msix_pba_offset;	/* MSI-X PBA offset */
	uint32_t		hs_msix_pba_rnumber;	/* MSI-X PBA reg# */

	mcxnex_priv_async_cb_t	async_cb;
	boolean_t		hs_quiescing;		/* in fastreboot */
	boolean_t		hs_vlan_strip_off_cap;
};
_NOTE(MUTEX_PROTECTS_DATA(mcxnex_state_s::hs_fw_flashlock,
    mcxnex_state_s::hs_fw_flashstarted
    mcxnex_state_s::hs_fw_flashdev
    mcxnex_state_s::hs_fw_log_sector_sz
    mcxnex_state_s::hs_fw_device_sz))
_NOTE(MUTEX_PROTECTS_DATA(mcxnex_state_s::hs_spec_qplock,
    mcxnex_state_s::hs_spec_qpflags
    mcxnex_state_s::hs_spec_qp0
    mcxnex_state_s::hs_spec_qp1))
_NOTE(MUTEX_PROTECTS_DATA(mcxnex_state_s::hs_mcglock,
    mcxnex_state_s::hs_mcghdl
    mcxnex_state_s::hs_mcgtmp))
_NOTE(DATA_READABLE_WITHOUT_LOCK(mcxnex_state_s::hs_in_evcallb
    mcxnex_state_s::hs_fw_log_sector_sz
    mcxnex_state_s::hs_fw_device_sz
    mcxnex_state_s::hs_spec_qpflags
    mcxnex_state_s::hs_spec_qp0
    mcxnex_state_s::hs_spec_qp1))
_NOTE(MUTEX_PROTECTS_DATA(mcxnex_state_s::hs_qpn_avl_lock,
    mcxnex_state_s::hs_qpn_avl))
_NOTE(SCHEME_PROTECTS_DATA("safe sharing",
    mcxnex_state_s::hs_fm_async_fatal
    mcxnex_state_s::hs_fw_sector))

/*
 * MCXNEX_IN_FASTREBOOT() shows if Mcxnex driver is at fastreboot.
 * This macro should be used to check if the mutex lock can be used
 * since the lock cannot be used if the driver is in the quiesce mode.
 */
#define	MCXNEX_IN_FASTREBOOT(state)	(state->hs_quiescing == B_TRUE)

/*
 * Bit positions in the "hs_spec_qpflags" field above.  The flags are (from
 * least significant to most): (QP0,Port1), (QP0,Port2), (QP1,Port1), and
 * (QP1,Port2).  The masks are there to help with some specific allocation
 * and freeing operations
 */
#define	MCXNEX_SPECIAL_QP0_RSRC		0
#define	MCXNEX_SPECIAL_QP0_RSRC_MASK	0x3
#define	MCXNEX_SPECIAL_QP1_RSRC		2
#define	MCXNEX_SPECIAL_QP1_RSRC_MASK	0xC


/*
 * These flags specifies additional behaviors on database access.
 * MCXNEX_UMAP_DB_REMOVE, for example, specifies that (if found) the database
 * entry should be removed from the database.  MCXNEX_UMAP_DB_IGNORE_INSTANCE
 * specifies that a particular database query should ignore value in the
 * "tdb_instance" field as a criterion for the search.
 */
#define	MCXNEX_UMAP_DB_REMOVE		(1 << 0)
#define	MCXNEX_UMAP_DB_IGNORE_INSTANCE	(1 << 1)

/*
 * The mcxnex_umap_db_t structure contains what is referred to throughout the
 * driver code as the "userland resources database".  This structure contains
 * all the necessary information to track resources that have been prepared
 * for direct-from-userland access.  There is an AVL tree ("hdl_umapdb_avl")
 * which consists of the "mcxnex_umap_db_entry_t" (below) and a lock to ensure
 * atomic access when adding or removing entries from the database.
 */
typedef struct mcxnex_umap_db_s {
	kmutex_t		hdl_umapdb_lock;
	avl_tree_t		hdl_umapdb_avl;
} mcxnex_umap_db_t;

/*
 * The mcxnex_umap_db_priv_t structure currently contains information necessary
 * to provide the "on close" callback to the firmware flash interfaces.  It
 * is intended that this structure could be extended to enable other "on
 * close" callbacks as well.
 */
typedef struct mcxnex_umap_db_priv_s {
	int		(*hdp_cb)(void *);
	void		*hdp_arg;
} mcxnex_umap_db_priv_t;

/*
 * The mcxnex_umap_db_common_t structure contains fields which are common
 * between the database entries ("mcxnex_umap_db_entry_t") and the structure
 * used to contain the search criteria ("mcxnex_umap_db_query_t").  This
 * structure contains a key, a resource type (described above), an instance
 * (corresponding to the driver instance which inserted the database entry),
 * and a "value" field.  Typically, "hdb_value" is a pointer to a Mcxnex
 * resource object.  Although for memory regions, the value field corresponds
 * to the ddi_umem_cookie_t for the pinned userland memory.
 * The structure also includes a placeholder for private data ("hdb_priv").
 * Currently this data is being used for holding "on close" callback
 * information to allow certain kinds of cleanup even if a userland process
 * prematurely exits.
 */
typedef struct mcxnex_umap_db_common_s {
	uint64_t		hdb_key;
	uint64_t		hdb_value;
	uint_t			hdb_type;
	uint_t			hdb_instance;
	void			*hdb_priv;
} mcxnex_umap_db_common_t;

/*
 * The mcxnex_umap_db_entry_t structure is the entry in "userland resources
 * database".  As required by the AVL framework, each entry contains an
 * "avl_node_t".  Then, as required to implement the database, each entry
 * contains a "mcxnex_umap_db_common_t" structure used to contain all of the
 * relevant entries.
 */
typedef struct mcxnex_umap_db_entry_s {
	avl_node_t		hdbe_avlnode;
	mcxnex_umap_db_common_t	hdbe_common;
} mcxnex_umap_db_entry_t;

/*
 * The mcxnex_umap_db_query_t structure is used in queries to the "userland
 * resources database".  In addition to the "mcxnex_umap_db_common_t" structure
 * used to contain the various search criteria, this structure also contains
 * a flags field "hqdb_flags" which can be used to specify additional behaviors
 * (as described above).  Specifically, the flags field can be used to specify
 * that an entry should be removed from the database, if found, and to
 * specify whether the database lookup should consider "tdb_instance" in the
 * search.
 */
typedef struct mcxnex_umap_db_query_s {
	uint_t			hqdb_flags;
	mcxnex_umap_db_common_t	hqdb_common;
} mcxnex_umap_db_query_t;
