Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.h
_NOTE(MUTEX_PROTECTS_DATA(mcxnex_umap_db_s::hdl_umapdb_lock,
    mcxnex_umap_db_entry_s::hdbe_avlnode
    mcxnex_umap_db_entry_s::hdbe_common.hdb_key
    mcxnex_umap_db_entry_s::hdbe_common.hdb_value
    mcxnex_umap_db_entry_s::hdbe_common.hdb_type
    mcxnex_umap_db_entry_s::hdbe_common.hdb_instance))

/*
 * The mcxnex_devmap_track_t structure contains all the necessary information
 * to track resources that have been mapped through devmap.  There is a
 * back-pointer to the Mcxnex softstate, the logical offset corresponding with
 * the mapped resource, the size of the mapped resource (zero indicates an
 * "invalid mapping"), and a reference count and lock used to determine when
 * to free the structure (specifically, this is necessary to handle partial
 * unmappings).
 */
typedef struct mcxnex_devmap_track_s {
	mcxnex_state_t	*hdt_state;
	uint64_t	hdt_offset;
	uint_t		hdt_size;
	int		hdt_refcnt;
	kmutex_t	hdt_lock;
} mcxnex_devmap_track_t;

#define	MCXNEX_ICM_SPLIT	64
#define	MCXNEX_ICM_SPAN		4096

#define	mcxnex_bitmap(bitmap, dma_info, icm_table, split_index)	\
	bitmap = (icm_table)->icm_bitmap[split_index];		\
	if (bitmap == NULL) {					\
		_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*(icm_table))) \
		int num_spans = (icm_table)->num_spans;		\
		bitmap =					\
		(icm_table)->icm_bitmap[split_index] =		\
		    kmem_zalloc((num_spans + 7) / 8, KM_SLEEP);	\
		ASSERT((icm_table)->icm_dma[split_index] == NULL); \
		(icm_table)->icm_dma[split_index] =		\
		    kmem_zalloc(num_spans * sizeof (mcxnex_dma_info_t), \
		    KM_SLEEP);					\
	}							\
	dma_info = (icm_table)->icm_dma[split_index]

/*
 * The mcxnex_icm_table_t encodes data pertaining to a given ICM table, and
 * holds an array of mcxnex_dma_info_t's related to its backing memory. Each
 * ICM table is sized during initialization, but real memory is allocated
 * and mapped into and out of ICM in the device throughout the life of the
 * instance. We use a bitmap to determine whether or not a given ICM object
 * has memory backing it or not, and an array of mcxnex_dma_info_t's to house
 * the actual allocations. Memory is allocated in chunks of span_size, stored
 * in the icm_dma array, and can later be looked up by using the bitmap index.
 * The total number of ICM spans is equal to table_size / span_size. We also
 * keep track of the ICM characteristics, such as ICM object size and the
 * number of entries in the ICM area.
 */
struct mcxnex_icm_table_s {
	kmutex_t		icm_table_lock;
	kcondvar_t		icm_table_cv;
	uint8_t			icm_busy;
	mcxnex_rsrc_type_t	icm_type;
	uint64_t		icm_baseaddr;
	uint64_t		table_size;
	uint64_t		num_entries;	/* maximum #entries */
	uint32_t		object_size;
	uint32_t		span;		/* #rsrc's per span */
	uint32_t		num_spans;	/* #dmainfos in icm_dma */
	uint32_t		split_shift;
	uint32_t		span_mask;
	uint32_t		span_shift;
	uint32_t		rsrc_mask;
	uint16_t		log_num_entries;
	uint16_t		log_object_size;
	/* two arrays of pointers, each pointer points to arrays */
	uint8_t			*icm_bitmap[MCXNEX_ICM_SPLIT];
	mcxnex_dma_info_t	*icm_dma[MCXNEX_ICM_SPLIT];
};

/*
 * Split the rsrc index into three pieces:
 *
 *      index1 - icm_bitmap[MCXNEX_ICM_SPLIT], icm_dma[MCXNEX_ICM_SPLIT]
 *      index2 - bitmap[], dma[]
 *      offset - rsrc within the icm mapping
 */
#define	mcxnex_index(index1, index2, rindx, table, offset)		\
	index1 = (rindx) >> table->split_shift;				\
	index2 = ((rindx) & table->span_mask) >> table->span_shift;	\
	offset = (rindx) & table->rsrc_mask

/* Defined in mcxnex.c */
int mcxnex_dma_alloc(mcxnex_state_t *state, mcxnex_dma_info_t *dma_info,
    uint16_t opcode);
void mcxnex_dma_attr_init(mcxnex_state_t *state, ddi_dma_attr_t *dma_attr);
void mcxnex_dma_free(mcxnex_dma_info_t *info);
int mcxnex_icm_alloc(mcxnex_state_t *state, mcxnex_rsrc_type_t type,
    uint32_t icm_index1, uint32_t icm_index2);
void mcxnex_icm_free(mcxnex_state_t *state, mcxnex_rsrc_type_t type,
    uint32_t icm_index1, uint32_t icm_index2);
void mcxnex_printf(mcxnex_state_t *, int, const char *, ...);

/* Defined in mcxnex_umap.c */
int mcxnex_devmap(dev_t dev, devmap_cookie_t dhp, offset_t off, size_t len,
    size_t *maplen, uint_t model);
ibt_status_t mcxnex_umap_ci_data_in(mcxnex_state_t *state,
    ibt_ci_data_flags_t flags, ibt_object_type_t object, void *hdl,
    void *data_p, size_t data_sz);
ibt_status_t mcxnex_umap_ci_data_out(mcxnex_state_t *state,
    ibt_ci_data_flags_t flags, ibt_object_type_t object, void *hdl,
    void *data_p, size_t data_sz);
void mcxnex_umap_db_init(void);
void mcxnex_umap_db_fini(void);
mcxnex_umap_db_entry_t *mcxnex_umap_db_alloc(uint_t instance, uint64_t key,
    uint_t type, uint64_t value);
void mcxnex_umap_db_free(mcxnex_umap_db_entry_t *umapdb);
void mcxnex_umap_db_add(mcxnex_umap_db_entry_t *umapdb);
void mcxnex_umap_db_add_nolock(mcxnex_umap_db_entry_t *umapdb);
int mcxnex_umap_db_find(uint_t instance, uint64_t key, uint_t type,
    uint64_t *value, uint_t flags, mcxnex_umap_db_entry_t **umapdb);
int mcxnex_umap_db_find_nolock(uint_t instance, uint64_t key, uint_t type,
    uint64_t *value, uint_t flags, mcxnex_umap_db_entry_t **umapdb);
void mcxnex_umap_umemlock_cb(ddi_umem_cookie_t *umem_cookie);
int mcxnex_umap_db_set_onclose_cb(dev_t dev, uint64_t flag,
    int (*callback)(void *), void *arg);
int mcxnex_umap_db_clear_onclose_cb(dev_t dev, uint64_t flag);
int mcxnex_umap_db_handle_onclose_cb(mcxnex_umap_db_priv_t *priv);
int mcxnex_rsrc_hw_entries_init(mcxnex_state_t *state,
    mcxnex_rsrc_hw_entry_info_t *info);
void mcxnex_rsrc_hw_entries_fini(mcxnex_state_t *state,
    mcxnex_rsrc_hw_entry_info_t *info);

#endif	/* _MCXNEX_H */
